# AddAllSegments Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurtainGridLine..::..AddAllSegments Method
CurtainGridLine Class See Also
---
All the segments on this grid line will be added.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void AddAllSegments()
```

Visual Basic
---
```text
Public Sub AddAllSegments
```

Visual C++
---
```text
public:
void AddAllSegments()
```

# See Also
CurtainGridLine Class
Autodesk.Revit.DB Namespace